tutorials/19ExplicitOpen/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
7125
(
(0.0017493472503835 -0.00174934725035575 0)
(0.00524100856012788 -0.00174231405947883 0)
(0.00871160268967747 -0.00172828007006382 0)
(0.0121471925296837 -0.00170730976988692 0)
(0.0155340014536542 -0.00167949915420157 0)
(0.0188584754723387 -0.0016449748645106 0)
(0.0221073434109043 -0.00160389307395092 0)
(0.0252676746327687 -0.00155643814789969 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomwall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomsym
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    cavitywall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
