tutorials/19ExplicitOpen/0/UNew
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
7125
(
(-0.000119422680118208 0.000119127350563395 0)
(-0.000223328715458766 7.29011059128696e-05 0)
(-6.85736944687725e-05 6.49036139575792e-07 0)
(0.000310168958372645 -5.22774123147577e-05 0)
(0.000814731341998365 -7.12174632969106e-05 0)
(0.00135845539549471 -7.42704502481915e-05 0)
(0.00190914546065176 -7.08625232271333e-05 0)
(0.00244812246412584 -6.71672591548367e-05 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetryPlane;
    }
    bottomwall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomsym
    {
        type            symmetryPlane;
    }
    cavitywall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}

