tutorials/19ExplicitOpen/0/Ub
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Ub;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }

    outlet
    {
        type           zeroGradient;
    }

   top
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }

   bottomwall
    {
	type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }

    bottomsym
    {

	type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }
    cavitywall
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
