tutorials/19ExplicitOpen/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
7125
(
(0.00174934725038136 -0.00174934725036066 0)
(0.00524100856021335 -0.00174231405945829 0)
(0.00871160268978792 -0.00172828007009275 0)
(0.0121471925298279 -0.0017073097698548 0)
(0.0155340014539552 -0.00167949915419861 0)
(0.0188584754726851 -0.00164497486458672 0)
(0.0221073434111781 -0.00160389307401276 0)
(0.0252676746332067 -0.00155643814789579 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomwall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomsym
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    cavitywall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
