tutorials/19ExplicitOpen/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cavitywall
    {
         type            zeroGradient;
	//type            symmetryPlane;
    }

    inlet
    {
        type            zeroGradient;
    }

    top
    {
        // type            symmetryPlane;
	type            zeroGradient;
    }

    bottomsym
    {
         //type            symmetryPlane;
	type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }


    bottomwall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
