tutorials/19ExplicitOpen/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
13990
(
6.99738900153402e-06
-6.99738900142299e-06
1.39666452389775e-05
-6.96925623791533e-06
2.08797655197324e-05
-6.91312028025526e-06
2.77090045990025e-05
-6.82923907954769e-06
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
25
(
-0.002
-0.002
-0.002
-0.002
-0.002
-0.002
-0.00199999999999998
-0.002
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
25
(
0.00200006612315961
0.00200006508016588
0.00200006301063926
0.00200005994724059
0.00200005593831491
0.00200005104712618
0.00200004535085748
0.002000038939391
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottomwall
    {
        type            calculated;
        value           uniform 0;
    }
    bottomsym
    {
        type            calculated;
        value           uniform 0;
    }
    cavitywall
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
