tutorials/19ExplicitOpen/0/phiNew
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
13990
(
-3.44764473696088e-07
3.44764473696012e-07
-2.95843035580599e-07
-4.89214381157198e-08
2.37873798342873e-07
-5.33716833923775e-07
1.12539919026008e-06
-8.87525391916837e-07
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
25
(
-0.002
-0.002
-0.002
-0.002
-0.002
-0.002
-0.00199999999999998
-0.002
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
25
(
0.0019972694648729
0.00199731418522115
0.00199740280983805
0.00199753372756856
0.00199770457258838
0.00199791228344073
0.00199815317648259
0.00199842303241533
...
)
;
    }
    top
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    bottomwall
    {
        type            calculated;
        value           uniform 0;
    }
    bottomsym
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    cavitywall
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}

