tutorials/19ExplicitOpen/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       13990;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       14015;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          185;
        startFace       14040;
    }
    bottomwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          58;
        startFace       14225;
    }
    bottomsym
    {
        type            wall;
        inGroups        1(wall);
        nFaces          77;
        startFace       14283;
    }
    cavitywall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       14360;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          14250;
        startFace       14510;
    }
)

// ************************************************************************* //
