tutorials/19ExplicitOpen/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 15;
NmodesUproj 12;
NmodesPout 15;
NmodesPproj 12;
NmodesSUPout 0;
NmodesSUPproj 0;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

// Specific problem of a stationary case
tolerance 1e-10;

// Reduced simple cicle parameters
residualJumpLim 1e-10;
normalizedResidualLim 1e-10;

bcMethod none;

timeDerivativeSchemeOrder first;

Method FE;

ExplicitMethod Ales;

PoissonMethod FOM;

// Inlet boundary conditions velocities.
online_velocities vel.txt;

debug 1;


