tutorials/19ExplicitOpen/system/blockMeshDictNew
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
      (0 0 0) 
      (1 0 0)
      (0 1 0)
      (1 1 0)
      (0 1.5 0)
      (1 1.5 0)

      (0 0 0.1)
      (1 0 0.1)
      (0 1 0.1)
      (1 1 0.1)
      (0 1.5 0.1)
      (1 1.5 0.1)

      (2.2 1 0)
      (2.2 1.5 0)
      (-1.2 1 0)
      (-1.2 1.5 0)
  
      (2.2 1 0.1)
      (2.2 1.5 0.1)
      (-1.2 1 0.1)
      (-1.2 1.5 0.1)

      (1.7 1 0)
      (1.7 1.5 0)
      (-0.7 1 0)
      (-0.7 1.5 0)
  
      (1.7 1 0.1)
      (1.7 1.5 0.1)
      (-0.7 1 0.1)
      (-0.7 1.5 0.1)
  
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (40 40 1) simpleGrading (1 1 1)
    hex (2 3 5 4 8 9 11 10) (40 40 1) simpleGrading (1 1 1)
    hex (14 22 23 15 18 26 27 19) (48 20 1) simpleGrading (1 1 1)
    hex (22 2 4 23 26 8 10 27) (48 20 1) simpleGrading (1 1 1)
    hex (3 20 21 5 9 24 25 11) (48 20 1) simpleGrading (1 1 1)
    hex (20 12 13 21 24 16 17 25) (48 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
   

    inlet
    {
        type wall;
        faces
        (
            (14 15 19 18)
        );
    }

    outlet
    {
        type wall;
        faces
        (
            (12 13 17 16)
        );
    }

    top
    {
        type wall;
        faces
        (
            (15 19 27 23)
	    (23 27 10 4)
	    (4 10 11 5)
	    (5 11 25 21)
            (21 25 17 13)
        );
    }

    bottomwall
    {
        type wall;
        faces
        (
            (22 26 8 2)
	    (3 9 24 20)
        );
    }

   bottomsym
    {
        type wall;
        faces
        (
            (14 18 26 22)
	    (20 24 16 12)
        );
    }

   cavitywall
    {
        type wall;
        faces
        (
            (0 6 8 2)
	    (1 7 9 3)
	    (0 6 7 1)
        );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 3 1)
            (6 8 9 7)
            (2 4 5 3)
            (8 10 11 9)
            (14 15 23 22)
            (18 19 27 26)
            (22 23 4 2)
            (26 27 10 8)
            (3 5 21 20)
            (9 11 25 24)
	    (20 21 13 12)
            (24 25 17 16)
        );
    }
);

mergePatchPairs
(
);

