tutorials/19ExplicitOpen/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;	 //Gauss midPoint;
    grad(p)         Gauss linear;      //Gauss midPoint;
}

divSchemes
{
    default         Gauss linear; //Gauss midPoint;
    //div(phi,U)      Gauss midPoint;
}

laplacianSchemes
{
    default         Gauss linear orthogonal; //Gauss midPoint orthogonal;
}

interpolationSchemes
{
    default         linear;//midPoint;
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    default         yes;
    p;
    //Phi;
}

// ************************************************************************* //
