tutorials/19ExplicitOpen/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.00;
    }

    pFinal
    {
        $p;
        relTol          0;
    }


P_rec
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.00;
    }

    P_recFinal
    {
        $P_rec;
        relTol          0;
    }


    pPost
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.00;
    }

    pPostFinal
    {
        $pPost;
        relTol          0;
    }

    p2Post
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.00;
    }

    p2Final
    {
        $p2;
        relTol          0;
    }

    p3Post
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.00;
    }

    p3Final
    {
        $p3;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
    }
    UFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
    }

    Phi
    {
        $p;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}
potentialFlow
{
    nNonOrthogonalCorrectors 10;
}


SIMPLE
{
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}




// ************************************************************************* //
